Autodesk.Revit.DB.ConfigurationReloadInfo.GetOutOfDatePartStatus(System.Int32)
Access reload information for out of date part.
index:
The index of the information about the part being reloaded. Must be between 0 and OutOfDatePartCount.
Returns:
Information about the part being reloaded.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The index is out of range.
Since:
2019

Autodesk.Revit.DB.ConfigurationReloadInfo.GetConnectivityValidation
Returns information about the post-reload connectivity validation.
Returns:
Information about the post-reload connectivity validation.
Since:
2016

Autodesk.Revit.DB.ConfigurationReloadInfo.FilesLoaded
The number of new/changed files that were reloaded.
Since:
2016